index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-22 Fri 22:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Creator’s Oath</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Creator’s Oath
<br />
<span class="subtitle">A manifesto for principled software builders who honor craft, integrity, and the user’s freedom.</span>
</h1>
<p>
This is a manifesto for creators who refuse to build noise.
It is an oath to create only what is worthy. For ourselves. For those who value their time. For a world that deserves better tools.
To build software that empower users, respect their freedom, and endures beyond fleeting trends.
</p>

<div id="outline-container-integrity" class="outline-2 principle">
<h2 id="integrity"><span class="section-number-2">1.</span> Build with integrity</h2>
<div class="outline-text-2" id="text-integrity">
<p>
I reject the siren call of market trends, praise, or pressure. I will create
what should exist: what is right and necessary, and what honors the user’s time,
focus and sovereignty. Worthy software solves real problems, enhances human
potential and respects autonomy without compromise. My work bears my name,
undiluted. I serve users by serving the work. The world's recognition is
secondary; I ship now.
</p>
</div>
</div>
<div id="outline-container-empower" class="outline-2 principle">
<h2 id="empower"><span class="section-number-2">2.</span> Empower the individual</h2>
<div class="outline-text-2" id="text-empower">
<p>
I build to liberate, not trap. My tools enable the individual's focus, freedom
and choice, holding their time and attention sacred. I reject manipulation with
fake urgency, dopamine loops or vanity metrics. Time is life. I measure outcomes
that reduce time-to-value and errors, not engagement for its own sake. I design
for opt-in attention and reversible choices. Like a well-made pen, my tools
vanish in use, freeing users to live beyond the screen.
</p>
</div>
</div>
<div id="outline-container-property" class="outline-2 principle">
<h2 id="property"><span class="section-number-2">3.</span> Your data, your property</h2>
<div class="outline-text-2" id="text-property">
<p>
You own your information. I am its steward while you choose to store it here.
You can take it, in full, at any time, in open documented formats. I will not
spy, sell, or silently change the rules. Where law or physics constrain
portability, I will state those limits plainly and early, and provide export
tools and deletion guarantees.
</p>
</div>
</div>
<div id="outline-container-ai" class="outline-2 principle">
<h2 id="ai"><span class="section-number-2">4.</span> AI as servant, never master</h2>
<div class="outline-text-2" id="text-ai">
<p>
AI amplifies human intent; it does not replace it. It may suggest, whether in
code completion or creative exploration, but it never dictates. Its actions are
transparent, attributable, reversible and bounded by explicit user permissions.
Human override is always available.
</p>
</div>
</div>
<div id="outline-container-simplicity" class="outline-2 principle">
<h2 id="simplicity"><span class="section-number-2">5.</span> Simplicity is strength</h2>
<div class="outline-text-2" id="text-simplicity">
<p>
I build with restraint: fewer features, each chosen with care to serve the
user's intent. What I remove is as vital as what I keep. No additions for
applause or competition. I resist the temptation to overreach, overpromise, or
overbuild. Simplicity is discipline: stripping away the unnecessary, leaving
tools that let people focus on what matters.
</p>

<p>
Simplicity is not ease. Ease seduces with familiarity and instant reward. Simple
means untangled: concerns kept separate, parts that compose, dependencies kept
few. Easy piles on shortcuts until nothing can move. Simple asks for thought up
front, but yields tools that endure: clear, reliable, and straightforward to
reason about.
</p>
</div>
</div>
<div id="outline-container-discipline" class="outline-2 principle">
<h2 id="discipline"><span class="section-number-2">6.</span> Craft with discipline</h2>
<div class="outline-text-2" id="text-discipline">
<p>
I will not ship ugliness. Software is a craft, and beauty matters.
Accessibility, security, performance budgets, and reliability are non-negotiable
parts of done. I will ship fewer features, built well and on time, rather than
many done poorly. I seek the balance between excellence and delivery. Neither
perfection that paralyzes nor mediocrity that corrodes.
</p>
</div>
</div>
<div id="outline-container-profit" class="outline-2 principle">
<h2 id="profit"><span class="section-number-2">7.</span> Profit on my terms</h2>
<div class="outline-text-2" id="text-profit">
<p>
I sustain my work through transparent, voluntary transactions, answering only to
those who value it. I reject surveillance, deceptive design, and hidden deals.
Pricing is simple and predictable. There are no lock-in terms. Refunds are fair.
Cancellation is as easy as sign-up.
</p>
</div>
</div>
<div id="outline-container-long_term" class="outline-2 principle">
<h2 id="long_term"><span class="section-number-2">8.</span> Build for the long term</h2>
<div class="outline-text-2" id="text-long_term">
<p>
I will not chase hypergrowth or exits. I may accept funding when it strengthens
the work, but never at the cost of integrity. I will design my systems to last,
using stable tools and minimal dependencies, so small teams can maintain them
and weather storms without panic. I will choose durability over trend-chasing,
stability over spectacle.
</p>
</div>
</div>
<div id="outline-container-collaboration" class="outline-2 principle">
<h2 id="collaboration"><span class="section-number-2">9.</span> Collaboration and community</h2>
<div class="outline-text-2" id="text-collaboration">
<p>
Collaboration is a voluntary exchange of value, where creators unite without
sacrificing vision. I join others to amplify strengths, not dilute purpose.
Decisions have clear owners; contributions are credited; dissent is welcomed and
examined; rationales are recorded. Community is a chorus of independent voices,
harmonized by shared respect, not conformity.
</p>
</div>
</div>
<div id="outline-container-stillness" class="outline-2 principle">
<h2 id="stillness"><span class="section-number-2">10.</span> Stillness and focus</h2>
<div class="outline-text-2" id="text-stillness">
<p>
I will create in stillness, unswayed by noise or urgency. I minimize
notifications and meetings. I focus on what I control: my craft, my purpose. And
I accept what I cannot, finding strength in clarity. I act where my will and
effort matter, and release what lies beyond my control. My energy will not be
wasted on outrage, trends or tides I cannot turn. I focus on the work itself,
for that is mine to command.
</p>
</div>
</div>
<div id="outline-container-reward" class="outline-2 principle">
<h2 id="reward"><span class="section-number-2">11.</span> The work is the reward</h2>
<div class="outline-text-2" id="text-reward">
<p>
The work is my purpose. I build for the joy of crafting what is worthy, trusting
its value will endure, whether seen or unseen by others.
</p>
</div>
</div>
<div id="outline-container-epilogue" class="outline-2 principle">
<h2 id="epilogue"><span class="section-number-2">12.</span> Epilogue</h2>
<div class="outline-text-2" id="text-epilogue">
<p>
I call on creators to join me in this pledge: to build with purpose, honor the
user and let the work stand as our truth. Adopt these principles in your craft,
share them with others and build software that reflects this vision. Together,
we can create a world of tools that empower, not enslave.
</p>

<div class="org-center">
<p>
Andreas Flakstad — August 20, 2025
</p>
</div>
</div>
</div>
</div>
</body>
</html>
